# Initializing SQL Server.

In [1]:
!pip install sqlalchemy
!pip install ipython-sql
!pip install pymysql

Requirement already satisfied: sqlalchemy in ./anaconda3/lib/python3.11/site-packages (2.0.25)
Requirement already satisfied: typing-extensions>=4.6.0 in ./anaconda3/lib/python3.11/site-packages (from sqlalchemy) (4.9.0)
Requirement already satisfied: greenlet!=0.4.17 in ./anaconda3/lib/python3.11/site-packages (from sqlalchemy) (3.0.1)
Collecting ipython-sql
  Downloading ipython_sql-0.5.0-py3-none-any.whl.metadata (17 kB)
Collecting prettytable (from ipython-sql)
  Downloading prettytable-3.10.2-py3-none-any.whl.metadata (30 kB)
Requirement already satisfied: ipython in ./anaconda3/lib/python3.11/site-packages (from ipython-sql) (8.20.0)
Requirement already satisfied: sqlalchemy>=2.0 in ./anaconda3/lib/python3.11/site-packages (from ipython-sql) (2.0.25)
Collecting sqlparse (from ipython-sql)
  Downloading sqlparse-0.5.1-py3-none-any.whl.metadata (3.9 kB)
Requirement already satisfied: six in ./anaconda3/lib/python3.11/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in ./anaconda3/lib/python3.11/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in ./anaconda3/lib/python3.11/site-packages (from sqlalchemy>=2.0->ipython-sql) (4.9.0)
Requirement already satisfied: greenlet!=0.4.17 in ./anaconda3/lib/python3.11/site-packages (from sqlalchemy>=2.0->ipython-sql) (3.0.1)
Requirement already satisfied: decorator in ./anaconda3/lib/python3.11/site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in ./anaconda3/lib/python3.11/site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: matplotlib-inline in ./anaconda3/lib/python3.11/site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in ./anaconda3/lib/python3.11/site-packages (from ipython->ipython-sql) (3.0.43)
Requirement already satisfied: pygments>=2.4.0 in ./anaconda3/lib/python3.11/site-packages (from ipython->ipython-sql) (2.15.1)
Requirement already satisfied: stack-data in ./anaconda3/lib/python3.11/site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5 in ./anaconda3/lib/python3.11/site-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: pexpect>4.3 in ./anaconda3/lib/python3.11/site-packages (from ipython->ipython-sql) (4.8.0)
Requirement already satisfied: wcwidth in ./anaconda3/lib/python3.11/site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in ./anaconda3/lib/python3.11/site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in ./anaconda3/lib/python3.11/site-packages (from pexpect>4.3->ipython->ipython-sql) (0.7.0)
Requirement already satisfied: executing in ./anaconda3/lib/python3.11/site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in ./anaconda3/lib/python3.11/site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in ./anaconda3/lib/python3.11/site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Downloading ipython_sql-0.5.0-py3-none-any.whl (20 kB)
Downloading prettytable-3.10.2-py3-none-any.whl (28 kB)
Downloading sqlparse-0.5.1-py3-none-any.whl (44 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.2/44.2 kB 4.2 MB/s eta 0:00:00
Installing collected packages: sqlparse, prettytable, ipython-sql
Successfully installed ipython-sql-0.5.0 prettytable-3.10.2 sqlparse-0.5.1
Collecting pymysql
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 45.0/45.0 kB 1.1 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1

In [ ]:
%load_ext sql

In [ ]:
%sql mysql+pymysql://linux:personallinux@167.172.79.235/my_database

In [5]:
import pandas as pd
from sqlalchemy import create_engine

# Load CSV file into a pandas DataFrame
df = pd.read_csv('VideoGameUsage_Profile.csv')

# Create a SQLAlchemy engine
engine = create_engine('mysql+pymysql://linux:personallinux@167.172.79.235/my_database')

# Import the DataFrame into the MySQL table
df.to_sql('my_table', con=engine, if_exists='append', index=False)

99

# Cleaning Up data

## Understanding the data

In [28]:
# Describe the table

%sql DESCRIBE my_table;

 * mysql+pymysql://linux:***@167.172.79.235/my_database
7 rows affected.

[('Age', 'bigint', 'YES', '', None, ''),
 ('Gender', 'text', 'YES', '', None, ''),
 ('student', 'text', 'YES', '', None, ''),
 ('play_video_game', 'text', 'YES', '', None, ''),
 ('favorite_game', 'text', 'YES', '', None, ''),
 ('most_played_game', 'text', 'YES', '', None, ''),
 ('reason_of_play_game', 'text', 'YES', '', None, '')]

In [13]:
# Check the Table to familliarize

%sql SELECT * FROM my_table LIMIT 10;

 * mysql+pymysql://linux:***@167.172.79.235/my_database
10 rows affected.

[(22, 'Male', 'Yes', 'Yes', 'FIFA 22', 'FIFA 22 ', 'competition'),
 (21, 'Male', 'Yes', 'Yes', 'Call of Duty', 'Call of Duty', 'entertainment'),
 (23, 'Male', 'Yes', 'Yes', 'GTA Vice City', 'GTA Vice City', 'entertainment'),
 (23, 'Male', 'Yes', 'sometimes', 'pubg', 'pubg', 'entertainment'),
 (23, 'Male', 'Yes', 'Yes', 'pubg', 'pubg', 'entertainment'),
 (23, 'Male', 'Yes', 'Yes', 'pubg', 'pubg', 'entertainment'),
 (23, 'Male', 'Yes', 'sometimes', 'GTA Vice City', 'GTA Vice City', 'entertainment'),
 (22, 'Male', 'Yes', 'Yes', 'Minecraft', 'Minecraft', 'entertainment'),
 (23, 'Male', 'No', 'Yes', 'Call of Duty', 'Call of Duty', 'entertainment'),
 (23, 'Male', 'Yes', 'Yes', 'FIFA 22', 'FIFA 22', 'entertainment')]

In [19]:
%%sql
SELECT 
    COUNT(*) - COUNT(Age) AS missing_age,
    COUNT(*) - COUNT(Gender) AS missing_gender,
    COUNT(*) - COUNT(Student) AS missing_student,
    COUNT(*) - COUNT(Play_Video_Game) AS missing_play_video_game,
    COUNT(*) - COUNT(Favorite_Game) AS missing_favorite_game,
    COUNT(*) - COUNT(Most_Played_Game) AS missing_most_played_game,
    COUNT(*) - COUNT(Reason_of_Play_Game) AS missing_reason_of_play_game
FROM my_table;

# Check for Missing Values

 * mysql+pymysql://linux:***@167.172.79.235/my_database
1 rows affected.

[(0, 0, 0, 0, 0, 0, 0)]

In [71]:
%%sql
UPDATE my_table
SET 
    Age = TRIM(Age),
    Gender = TRIM(Gender),
    Student = TRIM(Student),
    Play_Video_Game = TRIM(Play_Video_Game),
    Favorite_Game = TRIM(Favorite_Game),
    Most_Played_Game = TRIM(Most_Played_Game),
    Reason_of_Play_Game = TRIM(Reason_of_Play_Game);

# remove trailing and leading spaces

 * mysql+pymysql://linux:***@167.172.79.235/my_database
99 rows affected.
0 rows affected.

[]

## Clean Age Column

In [45]:
%%sql
SELECT MAX(Age), MIN(Age)
From my_table

# identify max and min value for the Age Column

 * mysql+pymysql://linux:***@167.172.79.235/my_database
1 rows affected.

[(27, 21)]

In [61]:
%%sql
SELECT DISTINCT Age
FROM my_table

# check for distinct values for each column

 * mysql+pymysql://linux:***@167.172.79.235/my_database
7 rows affected.

[(22,), (21,), (23,), (24,), (25,), (26,), (27,)]

## Clean Gender Column

In [72]:
%%sql
SELECT DISTINCT Gender
FROM my_table

 * mysql+pymysql://linux:***@167.172.79.235/my_database
2 rows affected.

[('Male',), ('Femal',)]

In [73]:
%%sql
UPDATE my_table
SET Gender = 'Female'
WHERE Gender = 'Femal';

# correct "Femal" typo to "Female"

 * mysql+pymysql://linux:***@167.172.79.235/my_database
7 rows affected.
0 rows affected.

[]

## Clean Student Column

In [76]:
%%sql
SELECT DISTINCT student
FROM my_table

 * mysql+pymysql://linux:***@167.172.79.235/my_database
2 rows affected.

[('Yes',), ('No',)]

## Clean play_video_game column

In [80]:
%%sql
SELECT DISTINCT play_video_game
FROM my_table

 * mysql+pymysql://linux:***@167.172.79.235/my_database
3 rows affected.

[('Yes',), ('sometimes',), ('No',)]

## Clean reason_of_play_game column

In [81]:
%%sql
SELECT DISTINCT reason_of_play_game
FROM my_table

# there seems to be a row that contains a game name we

 * mysql+pymysql://linux:***@167.172.79.235/my_database
5 rows affected.

[('competition',),
 ('entertainment',),
 ('GTA Vice City',),
 ('creativity',),
 ('relaxation',)]

In [83]:
%%sql
DELETE FROM my_table
WHERE reason_of_play_game = 'GTA Vice City'

# Remove the row that contains the game name 'GTA Vice City'

 * mysql+pymysql://linux:***@167.172.79.235/my_database
1 rows affected.

[]

In [84]:
%%sql
SELECT DISTINCT reason_of_play_game
FROM my_table

# recheck for distinct row

 * mysql+pymysql://linux:***@167.172.79.235/my_database
4 rows affected.

[('competition',), ('entertainment',), ('creativity',), ('relaxation',)]

# Data Analysis

In [86]:
%%sql
SELECT 
    COUNT(*) AS total_respondents,
    AVG(Age) AS average_age,
    MIN(Age) AS youngest,
    MAX(Age) AS oldest
FROM my_table;

 * mysql+pymysql://linux:***@167.172.79.235/my_database
1 rows affected.

[(98, Decimal('23.2959'), 21, 27)]

In [88]:
%%sql
SELECT Gender, COUNT(*) AS count, COUNT(*) * 100.0 / (SELECT COUNT(*) FROM my_table) AS percentage
FROM my_table
GROUP BY Gender;

 * mysql+pymysql://linux:***@167.172.79.235/my_database
2 rows affected.

[('Male', 91, Decimal('92.85714')), ('Female', 7, Decimal('7.14286'))]

In [91]:
%%sql
SELECT Student, COUNT(*) AS count, COUNT(*) * 100.0 / (SELECT COUNT(*) FROM my_table) AS percentage
FROM my_table
GROUP BY Student;

 * mysql+pymysql://linux:***@167.172.79.235/my_database
2 rows affected.

[('Yes', 88, Decimal('89.79592')), ('No', 10, Decimal('10.20408'))]

In [92]:
%%sql
SELECT Play_Video_Game, COUNT(*) AS count, COUNT(*) * 100.0 / (SELECT COUNT(*) FROM my_table) AS percentage
FROM my_table
GROUP BY Play_Video_Game;

 * mysql+pymysql://linux:***@167.172.79.235/my_database
3 rows affected.

[('Yes', 75, Decimal('76.53061')),
 ('sometimes', 22, Decimal('22.44898')),
 ('No', 1, Decimal('1.02041'))]

In [93]:
%%sql
SELECT 
    CASE 
        WHEN Age < 18 THEN 'Under 18'
        WHEN Age BETWEEN 18 AND 24 THEN '18-24'
        WHEN Age BETWEEN 25 AND 34 THEN '25-34'
        WHEN Age BETWEEN 35 AND 44 THEN '35-44'
        ELSE '45+'
    END AS age_group,
    COUNT(*) AS count,
    AVG(CASE WHEN Play_Video_Game = 'Yes' THEN 1 ELSE 0 END) AS gamer_percentage
FROM my_table
GROUP BY age_group
ORDER BY age_group;

 * mysql+pymysql://linux:***@167.172.79.235/my_database
2 rows affected.

[('18-24', 84, Decimal('0.7738')), ('25-34', 14, Decimal('0.7143'))]

In [94]:
%%sql
SELECT Favorite_Game, COUNT(*) AS count
FROM my_table
GROUP BY Favorite_Game
ORDER BY count DESC
LIMIT 10;

SELECT Most_Played_Game, COUNT(*) AS count
FROM my_table
GROUP BY Most_Played_Game
ORDER BY count DESC
LIMIT 10;

 * mysql+pymysql://linux:***@167.172.79.235/my_database
10 rows affected.
10 rows affected.

[('Minecraft', 25),
 ('GTA Vice City', 20),
 ('Call of Duty', 16),
 ('pubg', 11),
 ('FIFA 22', 7),
 ('Animal Crossing', 5),
 ('Stardew Valley', 3),
 ('League of Legends', 3),
 ('Apex Legends', 2),
 ('Rocket League', 1)]

In [95]:
%%sql
SELECT Reason_of_Play_Game, COUNT(*) AS count
FROM my_table
GROUP BY Reason_of_Play_Game
ORDER BY count DESC;

 * mysql+pymysql://linux:***@167.172.79.235/my_database
4 rows affected.

[('entertainment', 85),
 ('relaxation', 5),
 ('competition', 4),
 ('creativity', 4)]

In [96]:
%%sql
-- Gaming habits by gender
SELECT Gender, Play_Video_Game, COUNT(*) AS count
FROM my_table
GROUP BY Gender, Play_Video_Game
ORDER BY Gender, Play_Video_Game;

 * mysql+pymysql://linux:***@167.172.79.235/my_database
5 rows affected.

[('Female', 'sometimes', 3),
 ('Female', 'Yes', 4),
 ('Male', 'No', 1),
 ('Male', 'sometimes', 19),
 ('Male', 'Yes', 71)]

In [97]:
%%sql
SELECT Student, Favorite_Game, COUNT(*) AS count
FROM my_table
WHERE Student IS NOT NULL
GROUP BY Student, Favorite_Game
ORDER BY Student, count DESC
LIMIT 10;

 * mysql+pymysql://linux:***@167.172.79.235/my_database
10 rows affected.

[('No', 'Minecraft', 6),
 ('No', 'Call of Duty', 1),
 ('No', 'FIFA 22', 1),
 ('No', 'GTA Vice City', 1),
 ('No', 'Stardew Valley', 1),
 ('Yes', 'GTA Vice City', 19),
 ('Yes', 'Minecraft', 19),
 ('Yes', 'Call of Duty', 14),
 ('Yes', 'pubg', 11),
 ('Yes', 'FIFA 22', 6)]

In [98]:
%%sql
SELECT 
    CASE 
        WHEN Age < 18 THEN 'Under 18'
        WHEN Age BETWEEN 18 AND 24 THEN '18-24'
        WHEN Age BETWEEN 25 AND 34 THEN '25-34'
        WHEN Age BETWEEN 35 AND 44 THEN '35-44'
        ELSE '45+'
    END AS age_group,
    Play_Video_Game,
    COUNT(*) AS count
FROM my_table
GROUP BY age_group, Play_Video_Game
ORDER BY age_group, Play_Video_Game;

 * mysql+pymysql://linux:***@167.172.79.235/my_database
5 rows affected.

[('18-24', 'sometimes', 19),
 ('18-24', 'Yes', 65),
 ('25-34', 'No', 1),
 ('25-34', 'sometimes', 3),
 ('25-34', 'Yes', 10)]

In [99]:
%%sql
SELECT 
    Student, 
    Play_Video_Game, 
    COUNT(*) AS count,
    COUNT(*) * 100.0 / SUM(COUNT(*)) OVER (PARTITION BY Student) AS percentage
FROM my_table
WHERE Student IS NOT NULL
GROUP BY Student, Play_Video_Game
ORDER BY Student, Play_Video_Game;

 * mysql+pymysql://linux:***@167.172.79.235/my_database
5 rows affected.

[('No', 'sometimes', 2, Decimal('20.00000')),
 ('No', 'Yes', 8, Decimal('80.00000')),
 ('Yes', 'No', 1, Decimal('1.13636')),
 ('Yes', 'sometimes', 20, Decimal('22.72727')),
 ('Yes', 'Yes', 67, Decimal('76.13636'))]

In [100]:
%%sql
WITH age_groups AS (
    SELECT *,
    CASE 
        WHEN Age < 18 THEN 'Under 18'
        WHEN Age BETWEEN 18 AND 24 THEN '18-24'
        WHEN Age BETWEEN 25 AND 34 THEN '25-34'
        WHEN Age BETWEEN 35 AND 44 THEN '35-44'
        ELSE '45+'
    END AS age_group
    FROM my_table
)
SELECT age_group, Favorite_Game, COUNT(*) AS count
FROM age_groups
GROUP BY age_group, Favorite_Game
HAVING COUNT(*) = (
    SELECT COUNT(*)
    FROM age_groups ag2
    WHERE ag2.age_group = age_groups.age_group
    GROUP BY ag2.age_group, ag2.Favorite_Game
    ORDER BY COUNT(*) DESC
    LIMIT 1
)
ORDER BY age_group;

 * mysql+pymysql://linux:***@167.172.79.235/my_database
3 rows affected.

[('18-24', 'Minecraft', 23),
 ('25-34', 'FIFA 22', 3),
 ('25-34', 'GTA Vice City', 3)]